Repository: NateWeiler/Resources
Catalog: Python/Projects/sphinx/sphinx-doc-translations/locale/*/LC_MESSAGES/ext/extlinks.po
Languages: pt_br

source: :mod:`sphinx.ext.extlinks` -- Markup to shorten external links
pt_br: :mod:`sphinx.ext.extlinks` -- Marcação para encurtar links externos

source: This extension is meant to help with the common pattern of having many external links that point to URLs on one and the same site, e.g. links to bug trackers, version control web interfaces, or simply subpages in other websites. It does so by providing aliases to base URLs, so that you only need to give the subpage name when creating a link.
pt_br: Essa extensão facilita a existência de um padrão comum para diversos links que apontam para uma URL em um site, ex. links para rastrear erros, controle de versão na web ou simples páginas de outros sites. Não fornece apelidos para URLs portanto só é preciso informar o nome da sub-página quando criar o link.

source: Let's assume that you want to include many links to issues at the Sphinx tracker, at :samp:`https://github.com/sphinx-doc/sphinx/issues/{num}`. Typing this URL again and again is tedious, so you can use :mod:`~sphinx.ext.extlinks` to avoid repeating yourself.
pt_br: Vamos supor que deseja incluir diversos links para solicitações no Sphinx tracker, em :samp:`https://github.com/sphinx-doc/sphinx/issues/{num}`. Digitando esse URL novamente em diversos lugares torna-se cansativo, então usar :mod:`~sphinx.ext.extlinks` para evitar repetições.

source: The extension adds one new config value:
pt_br: A extensão adiciona um novo valor configurado:

source: This config value must be a dictionary of external sites, mapping unique short alias names to a base URL and a *prefix*. For example, to create an alias for the above mentioned issues, you would add ::
pt_br: Esse valor configurado pode ser um dicionário de sites, mapeamentos únicos para nomes alternativos para uma URL base e um *prefix*. Por exemplo, para criar um apelido para os casos acima, podemos adicionar ::

source: Now, you can use the alias name as a new role, e.g. ``:issue:`123```. This then inserts a link to https://github.com/sphinx-doc/sphinx/issues/123. As you can see, the target given in the role is substituted in the base URL in the place of ``%s``.
pt_br: Agora pode usar o nome alternativo como uma nova regra, ex. ``:issue:`123```. Isso irá inserir um link para https://github.com/sphinx-doc/sphinx/issues/123. Como pode ser visto, o alvo dado na regra é substituido na URL base e colocado em ``%s``.

source: The link *caption* depends on the second item in the tuple, the *prefix*:
pt_br: A legenda do link *caption* depende do segundo item da tuple, o *prefix*:

source: If the prefix is ``None``, the link caption is the full URL.
pt_br: Se o prefixo é ``None``, a legenda do link é URL integral.

source: If the prefix is the empty string, the link caption is the partial URL given in the role content (``123`` in this case.)
pt_br: Se o prefixo é uma string vazia, a legenda do link é URL parcial informada na regra de conteúdo (``123`` nesse caso.)

source: If the prefix is a non-empty string, the link caption is the partial URL, prepended by the prefix -- in the above example, the link caption would be ``issue 123``.
pt_br: Se o prefixo é uma string não vazia, a legenda da URL parcial, prefixada pelo prefixo acima -- no exemplo acima, a legenda será ``issue 123``.

source: You can also use the usual "explicit title" syntax supported by other roles that generate links, i.e. ``:issue:`this issue <123>```. In this case, the *prefix* is not relevant.
pt_br: Também podemos usar "título explícito" sintaxe suportada por outras regras que geram links, ex. ``:issue:`essa pendência <123>```. Nesse caso o *prefix* não é relevante.

source: Since links are generated from the role in the reading stage, they appear as ordinary links to e.g. the ``linkcheck`` builder.
pt_br: Como os links são gerados a partir da leitura da regra em outro estágio, podem aparecer como links comuns ex. construtor ``linkcheck``.
