Repository: NateWeiler/Resources
Catalog: Python/Python Players/FestEngine/src/locale/*/LC_MESSAGES/main.po
Languages: ru

source: Unfortunately, you broke the JSON format... Please fix the configuration file%s ASAP. Details: %s
ru: К сожалению, вы поломали формат JSON... Пожалуйста, поправьте файл конфигурации%s как можно скорее. Подробности ошибки: %s

source: &Load ZAD and MP3
ru: &Загрузить треки и задники

source: Open &Folder with '%s'
ru: Открыть &папку с '%s'

source: Open '%s' Folder
ru: Открыть папку '%s'

source: Open &Background Music Folder
ru: Открыть папку &фоновых треков

source: &Settings
ru: &Настройки

source: &Show Log
ru: Открыть окно &лога

source: &Prefer No Video (fallback)
ru: Не включать &видео когда есть звук

source: &End show on BG Music Start
ru: &Прерывать номер при запуске подложки

source: Auto Show &ZAD with Sound
ru: Ставить &задник при запуске трека

source: &About
ru: &О программе

source: E&xit
ru: Вы&ход

source: &Main
ru: &Глагнэ

source: &Replace File
ru: &Заменить файл

source: &Delete item
ru: &Удалить строку

source: &Add intermission (countdown) above
ru: Вставить перерыв сверху

source: &Add intermission (countdown) below
ru: Вставить &перерыв снизу

source: &Item
ru: С&трока

source: &Create
ru: &Создать

source: &Destroy
ru: &Убрать

source: &Projector Window
ru: Окно &проектора

source: &Show
ru: &Создать

source: &Full Info
ru: &Показывать все данные

source: &Text Window
ru: &Текстовое окно

source: &Load Files
ru: Загрузить &файлы

source: &Open Window
ru: &Открыть окно

source: &Fade In/Out Enabled
ru: &Плавный переход звука

source: &Play Selected Item F4
ru: &Включить выделенный трек F4

source: &Pause F3
ru: &Пауза F3

source: &Background Music
ru: &Фоновая музыка

source: &Emergency Stop All Shift+Esc
ru: &Экстренная остановка всего Shift+Esc

source: Show &ZAD F1
ru: Показать &задник F1

source: &Clear ZAD Shift+F1
ru: &Снять задник Shift+F1

source: &Play Sound/Video F2
ru: &Запустить звук/видео F2

source: &Fade Out Shift+F2
ru: &Остановить звук/видео Shift+F2

source: &End Show (Clear ZAD + Fade Out) Esc
ru: &Прервать номер (снять задник + останвоить трек) Esc

source: &Black Screen Alt+F1
ru: &Черный экран Alt+F1

source: Play/Pause &Background (+ End Show) F3
ru: Play/Pause &фоновой музыки (+ прервать номер) F3

source: Play &Next BG Track Shift+F4
ru: Включить &следующий фоновый трек Shift+F4

source: &Fire
ru: &Запуск

source: Fade out
ru: Прервать

source: Find
ru: Поиск

source: Right-click to quit search
ru: Кликните правой кнопкой, чтобы выйти из поиска

source: You may want to restart FestEngine. Do it?
ru: Можно перезапустить Fest Engine?

source: Restart Required
ru: Требуется перезапуск

source: No filename regular expression or ZAD path is invalid or MP3 path is invalid. Please specify valid paths to folders with your files, and regular expression that parses your filenames in settings or .fest file. Directories: %s Filename RegEx: %s
ru: Нет либо регулярного выражения, либо ни одной папки треков. Пожалуйста, укажите в настройках правильные пути и регулярное выражение которое будет имена ваших файлов. Папки с треками: %s Регулярное выражение: %s

source: Path Error
ru: Кривой путь

source: No 'num' group in filename RegEx. We recommend using a unique sorting-friendly three-digit number at the beginning of all filenames. The order should correspond to your event's program In this case the RegEx will look like this: ^(?P<num>\d{3})(?P<name>.*) Your filename RegEx: %s
ru: Не найдена группа 'num' в регулярном выражении. Рекомендуется использовать уникальный всегда трехзначный номер в начале каждого имени файла. Порядок номеров должен соответствовать программе мероприятия. В описанном случае, регулярное выражение примерно такое: ^(?P<num>\d{3})(?P<name>.*) Ваше регулярное выражение: %s

source: No '%s' group in filename RegEx. It is required to set the countdown description. The simplest RegEx looks like this: ^(?P<num>\d{3})(?P<name>.*) Your filename RegEx: %s
ru: Не задана группа '%s' в регулярном выражении. Она необходима для обратного отсчета. Самый простой вариант регулярного выражения: ^(?P<num>\d{3})(?P<name>.*) Ваше регулярное выражение: %s

source: [WARNING] File %s does not match filename_re
ru: [ВНИМАНИЕ] Файл %s не соответствует регулярному выражению и был проигнорирован

source: [WARNING] Inconsistent value '%s': changing '%s' to '%s'. Item: %s
ru: [ВНИМАНИЕ] Неоднозначное значение '%s': меняем '%s' на '%s'. Номер: %s

source: Duplicate files found: %s Conflicts with: %s
ru: Обнаружен дубликат! Этот файл: %s конфликтует с: %s

source: Original file backed up as '%s'; File '%s' copied in place of '%s'
ru: Резервная копия оригинального файла сохранена в файл '%s'; Файл '%s' скопирован на место '%s'

source: ALREADY PLAYING! Hit Esc to restart!
ru: ПОВТОРНОЕ ВКЛЮЧЕНИЕ ПРЕДОТВРАЩЕНО!!!

source: Invalid countdown row
ru: Неверная строка обратного отсчета

source: Nothing to play for %s%s
ru: Нечего включить для %s%s

source: Playback FAILED !!!
ru: НЕ УДАЛОСЬ запустить !!!

source: Background MP3 path is invalid. Please specify a valid path with your background tracks in settings. Found path: %s
ru: Неправильный путь к фоновым трекам. укажите правильный путь в настройках, плиз. Сейчас там это: %s

source: No Cosplay2 database in config
ru: Не указан путь к базе данных Cosplay2

source: Cosplay2 database not found
ru: База данных Cosplay2 не найдена

source: Text Data
ru: Информация о номере

source: Item not found in the database. Watch the log.
ru: Номер не найден в БД. Детали в логе.

source: Settings
ru: Настройки

source: Hi ^_^ Please select a new or existing *.fest file in the 'Current Fest' field. It will load automatically on each start unless you change it. The configuration may seem confusing, if you find it so, open the 'File | About' menu item. Do the best event!
ru: Привет! ^_^ Для начала, укажи новый или существующий файл феста. Он будет автоматически загружаться при запуске пока его не сменишь. Если возникают сложности с настройками, открой "Файл | О программе" Ваш фест будет лучшим!

source: Current Fest
ru: Файл феста

source: All Settings
ru: Ручная настройка

source: Windowed (for debugging)
ru: В окне (для отладки)

source: Projector Screen
ru: Окно проектора

source: Filename RegEx
ru: Регулярное выражение имён файлов

source: Cosplay2 Database Path
ru: Путь к БД Cosplay2

source: Background Tracks Dir
ru: Папка с фоновой музыкой

source: Background ZAD Path
ru: Фоновая картинка

source: Files Dirs
ru: Папки с треками

source: Load
ru: Загрузить

source: Save
ru: Сохранить

source: Cancel
ru: Отмена

source: Invalid Background Tracks Dir
ru: Папка с фоновой музыкой не найдена

source: Invalid Files dir
ru: Папка с треками не найдена

source: Invalid Background ZAD Path
ru: Фоновая картинка не найдена

source: The operating system is opening the '%s' file. It is in JSON format, use any plain-text editor to open it. For instance: AkelPad, Visual Studio Code, Notepad, etc. Edit the file very carefully and save it. Then hit 'OK' to load the new config or 'Cancel' to revert your changes.
ru: Операционная система открывает файл '%s'. Это формат JSON, его можно открыть, любым редактором простого текста, например AkelPad, Visual Studio Code, Notepad, и т.д. Аккуратно отредактируйте файл и сохраните его. Потом нажмите 'OK' для загрузки новой конфигурации или 'Отмена' для отката всех изменений.

source: Manual Configuration
ru: Ручная настройка
