Repository: NateWeiler/Resources
Catalog: Python/genxword/po/*.po
Languages: es, gl, th

source: The word list file contains the words and clues, or just words, that you want in your crossword. For further information on how to format the word list file and about the other options, please consult the man page.
es: La lista de palabras contiene las palabras y las definiciones, o sólo las palabras, que quiera en su crucigrama. Para obtener más información de cómo formatear el archivo de listas de palabras y sobre otras opciones, consulte el manual.
gl: A lista de palabras conten as palabras e as definicións, ou só as palabras, que queira no seu encrucillado. Para obter máis información de como formatar o ficheiro de listas de palabras e sobre outras opcións, consulte o manual.
th: เอกสารรายการคำศัพท์บรรจุคำศัพท์และคำใบ้หรือแค่คำศัพท์ที่คุณต้องการสำหรับปริศนาอักษรไขว้ของคุณ สำหรับข้อมูลที่นอกเหนือจากนี้เกี่ยวกับรูปแบบของเอกสารรายการคำศัพท์หรือเกี่ยวกับตัวเลือกอื่นๆ กรุณาปรึกษาผู้สร้างเพจ

source: Enter grid size (
es: Escriba el tamaño de la cuadrícula (
gl: Escriba o tamaño da gradicela (
th: ใส่ขนาดอนุกรมของจุดที่จะช่วยวางภาพหรือข้อความในตำแหน่งที่เป็นแนวเดียวกัน (

source: is the default):
es: es el predeterminado):
gl: é o predeterminado):
th: คือค่าที่เลือกอัตโนมัติ):

source: Calculating your crossword...
es: Calculando su crucigrama...
gl: Calculando o seu encrucillado...
th: กำลังคำนวณปริศนาอักษรไขว้ของคุณ...

source: Are you happy with this solution? [Y/n]
es: ¿Te gusta esta solución? [S/n]
gl: Gústache esta solución? [S/n]
th: คุณพึงพอใจกับผลลัพธ์นี้หรือไม่? [ใช่/ไม่]

source: And increase the grid size? [Y/n]
es: ¿Y aumentar el tamaño de la cuadrícula? [S,n]
gl: E aumentar o tamaño da gradicela? [S,n]
th: และเพิ่มขนาดอนุกรมของจุดที่จะช่วยวางภาพหรือข้อความในตำแหน่งที่เป็นแนวเดียวกัน? [ใช่/ไม่]

source: Across/Down
es: Horizontal/Vertical
gl: Horizontal/Vertical
th: แนวขวาง/แนวลง

source: The following files have been saved to your current working directory:
es: Los siguientes archivos se han guardado en su directorio de trabajo actual:
gl: Os seguintes ficheiro foron gardados no seu directorio de traballo actual:
th: เอกสารเหล่านี้ได้ถูกบันทึกไว้ที่สมุดรายชื่อการทำงานปัจจุบันของคุณแล้ว:

source: Crossword generator.
es: Generador de crucigramas.
gl: Xerador de encrucillados.
th: การสร้างปริษนาอักษรไขว้

source: Name of word list file.
es: Nombre del archivo de la lista de palabras.
gl: Nome do ficheiro da lista de palabras.
th: ชื่อของรายการเอกสารคำศัพท์

source: Save files as A4 pdf (p), letter size pdf (l), png (n) and/or svg (s).
es: Guardar archivos como pdf en A4 (p), pdf en tamaño carta (l), png (n) y/o svg (s).
gl: Gardar os ficheiros como pdf en A4 (p), pdf en tamaño carta (l), png (n) e/ou svg (s).
th: บันทึกเอกสารในรูปแบบของ เอสี่ พีดีเอฟ (p), ขนาดจดหมด พีดีเอฟ (l), พีเอ็นจี (n) และ/หรือ เอสวีจี (s)

source: Automated (non-interactive) option.
es: Opción automática (no interactiva).
gl: Opción automática (non interactiva).
th: ตัวเลือก ไม่เข้าสู่ระบบ แบบอัตโนมัติ

source: Create anagrams for the clues
es: Crear anagramas para las definiciones
gl: Crear anagramas para as definicións
th: การสร้างการสับเปลี่ยนพยัญชนะของคำหรือวลีเพื่อให้ได้คำหรือวลีใหม่สำหรับใช้ในการบอกใบ้

source: Number of words to be used.
es: Número de palabras a usar.
gl: Número de palabras a usar.
th: จำนวนของคำศัพท์ที่ถูกใช้

source: Name of crossword.
es: Nombre del crucigrama.
gl: Nome do encrucillado.
th: ชื่อของปริศนาอักษรไขว้

source: _Word list
es: _Lista de palabras
gl: _Lista de palabras
th: _รายการคำศัพท์

source: _New word list
es: _Nueva lista
gl: _Nova lista
th: _รายการคำศัพท์ใหม่

source: Create a new word list or go back to the already open word list
es: Cree una nueva lista de palabras o vuelva a la lista ya abierta
gl: Cree unha nova lista de palabras ou volva á lista xa aberta
th: สร้างรายการคำศัพท์ใหม่หรือกลับไปที่รายการคำศัพท์ที่ได้เปิดไว้อยู่แล้วก่อนหน้านี้

source: _Open word list
es: _Abrir lista
gl: _Abrir lista
th: _เปิดรายการคำศัพท์

source: Open a word list
es: Abrir una lista de palabras
gl: Abrir unha lista de palabras
th: เปิดรายการคำศัพท์หนึ่งคำศัพท์

source: _Sort word list
es: _Ordenar una lista
gl: _Ordenar unha lista
th: _ประเภทรายการคำศัพท์

source: Sort the word list and remove words with non-alphabetic characters
es: Ordenar la lista de palabras y borrar palabras con caracteres no alfanuméricos
gl: Ordenar a lista de palabras e retirar as palabras con caracteres non alfanuméricos
th: ประเภทรายการคำศัพท์และย้ายคำศัพท์โดยการไม่ใช้สัญลักษณ์ตัวอักษร

source: Quit
es: Salir
gl: Saír
th: ล้มเลิก

source: _Crossword
es: _Crucigrama
gl: _Encrucillado
th: _ปริศนาอักษรไขว้

source: _Calculate crossword
es: _Calcular crucigrama
gl: _Calcular o encrucillado
th: _คำนวณปริศนาอักษรไขว้

source: Calculate the crossword
es: Calcula crucigrama
gl: Calcula o encrucillado
th: _คำนวณปริศนาอักษรไขว้นั้น

source: _Recalculate
es: _Recalcular
gl: _Volver calcular
th: _คำนวนอีกครั้ง

source: Increase the grid size and recalculate the crossword
es: Incrementar el tamaño de la cuadrícula y recalcular el crucigrama
gl: Incrementar o tamaño da gradicela e volver calcular o encrucillado
th: เพิ่มขนาดอนุกรมของจุดที่จะช่วยวางภาพหรือข้อความในตำแหน่งที่เป็นแนวเดียวกันและคำนวณปริศนาอักษรไขว้นั้นอีกครั้ง

source: _Save
es: _Guardar
gl: _Gardar
th: _บันทึก

source: Save crossword
es: Guardar el crucigrama
gl: Gardar o encrucillado
th: บันทึกปริศนาอักษรไขว้

source: _Help
es: _Ayuda
gl: _Axuda
th: _ช่วยเหลือ

source: Open the help page
es: Abrir la página de ayuda
gl: Abrir a páxina de axuda
th: เปิดหน้าช่วยเหลือ

source: _About
es: _Sobre
gl: _Sobre
th: _เกี่ยวกับ

source: About
es: Sobre
gl: Sobre
th: เกี่ยวกับ

source: Anagram clues
es: Definiciones del anagrama
gl: Definicións do anagrama
th: การสับเปลี่ยนพยัญชนะของคำหรือวลีเพื่อให้ได้คำหรือวลีใหม่สำหรับใช้ในการบอกใบ้

source: Choose the grid size
es: Elija el tamaño de la cuadrícula
gl: Escolla o tamaño da gradicela
th: เลือกขนาดของการสับเปลี่ยนพยัญชนะของคำหรือวลีเพื่อให้ได้คำหรือวลีใหม่

source: Save the crossword as
es: Guardar el crucigrama como
gl: Gardar o encrucillado como
th: บันทึกปริศนาอักษรไขว้ในรูปแบบของ

source: letter pdf
es: carta pdf
gl: carta pdf

source: Name of crossword
es: Nombre del crucigrama
gl: Nome do encrucillado
th: ชื่อของปริศนาอักษรไขว้

source: Choose the name of your crossword
es: Elija el nombre de su crucigrama
gl: Escolla o nome do seu encrucillado
th: เลือกชื่อสำหรับปริศนาอักษรไขว้ของคุณ

source: Number of words
es: Número de palabras
gl: Número de palabras
th: จำนวนของคำศัพท์

source: Choose the number of words you want to use
es: Elija el número de palabras que quiere usar
gl: Escolla o número de palabras que quere usar
th: เลือกจำนวนของคำที่คุณต้องการใช้

source: Grid size
es: Tamaño de la cuadrícula
gl: Tamaño da gradicela
th: ขนาดอนุกรมของจุดที่จะช่วยวางภาพหรือข้อความในตำแหน่งที่เป็นแนวเดียวกัน

source: Choose the crossword grid size Go to the Crossword menu to enable this option
es: Elija el tamaño de la cuadrícula del crucigrama Vaya al menú «Crucigrama» para permitir esta opción
gl: Escolla o tamaño de gradicela do encrucillado Vaia ao menú «Encrucillado» para activar esta opción
th: เลือกขนาดอนุกรมของจุดที่จะช่วยวางภาพหรือข้อความในตำแหน่งที่เป็นแนวเดียวกันของปริศนาอักษรไขว้นั้น ไปที่รายการปริศนาอักษรไขว้เพื่อที่จะสามารถใช้ตัวเลือกนี้

source: Please choose a file
es: Elija un archivo
gl: Escolla un ficheiro
th: กรุณาเลือกเอกสาร

source: Please choose a folder
es: Elija una carpeta
gl: Escolla un cartafol
th: กรุณาเลือกแฟ้มเอกสาร

source: Your crossword files have been saved in
es: Los archivos de su crucigrama se han guardado en
gl: Os ficheiros do seu encrucillado foron gardados en
th: เอกสารของปริศนาอักษรไขว้ของคุณได้ถูกบันทึกไว้ใน

source: Please fill in the name of the crossword and the format you want it saved in (A4 size pdf, letter size pdf, png or svg). Then click on the Save button again.
es: Rellene el nombre del crucigrama y el formato en que que desea guardarlo (pdf tamaño A4, pdf tamaño carta, png o svg). Luego pulse en el botón Guardar de nuevo.
gl: Encha o nome do encrucillado e o formato no que quere gardalo (pdf tamaño A4, pdf tamaño carta, png ou svg). A seguir prema no botón Gardar de novo.
th: กรุณาใส่ชื่อของปริศนาอักษรไขว้และรูปแบบที่คุณต้องการที่จะบันทึกใน (ขนาดเอสี่ พีดีเอฟ, ขนาดจดหมาย พีดีเอฟ, พีเอ็นจี หรือ เอสวีจี) หลังจากนั้นให้กดที่ปุ่มบันทึกอีกครั้ง

source: A crossword generator
es: Un generador de crucigramas
gl: Un xerador de encrucillados
th: การสร้างปริศนาอักษรไว้
