Repository: NateWeiler/Resources
Catalog: Python/Projects/sphinx/sphinx-doc-translations/locale/*/LC_MESSAGES/intro.po
Languages: ja, ru

source: Introduction
ja: イントロダクション
ru: Введение

source: This is the documentation for the Sphinx documentation builder. Sphinx is a tool that translates a set of reStructuredText_ source files into various output formats, automatically producing cross-references, indices, etc. That is, if you have a directory containing a bunch of reST-formatted documents (and possibly subdirectories of docs in there as well), Sphinx can generate a nicely-organized arrangement of HTML files (in some other directory) for easy browsing and navigation. But from the same source, it can also generate a PDF file using LaTeX.
ja: これはSphinxドキュメンテーションビルダーのドキュメントです。Sphinxは一連の reStructuredText_ （以下reST）のソースファイルを様々な出力形式に変換したり、クロスリファレンスやインデックスなどを自動生成するツールです。つまり、reSTフォーマットのドキュメント群を含むディレクトリを用意すれば、Sphinxはブラウザでの閲覧が容易でナビゲーションがある構造がしっかりしたHTMLファイル群を生成することができます。ソースがサブディレクトリに分かれていても問題はありません。それだけではなく、同じソースファイルから、LaTeXを用いてPDFファイルも生成することができます。
ru: Это руководство по системе сборки документации Sphinx. Sphinx --- это инструмент, который преобразует набор исходных файлов в формате reStructuredText_ в различные выходные форматы, автоматически расставляет перекресные ссылки, индексы и т. д. То есть, если у вас есть каталог, содержащий набор документов в формате reST (и, возможно, подкаталоги с документами), Sphinx может создать хорошо организованную структуру HTML-файлов (в отдельной директории) для удобного просмотра и навигации. Также из этого источника он может создать PDF-файл используя LaTeX.

source: The focus is on hand-written documentation, rather than auto-generated API docs. Though there is support for that kind of documentation as well (which is intended to be freely mixed with hand-written content), if you need pure API docs have a look at `Epydoc <http://epydoc.sourceforge.net/>`_, which also understands reST.
ja: このドキュメントでは、自動生成のAPIのドキュメントではなく、手で作成するドキュメンテーションにフォーカスします。そのようなドキュメントのサポートに関してはまだ限定的にはあります(手で作成するコンテンツも自由に追加できるようにする予定)が、もし純粋なAPIドキュメントが必要であれば、 `Epydoc <http://epydoc.sourceforge.net/>`_ をご覧ください。こちらもreSTを解釈することができます。
ru: В основном, Sphinx предназначен для обработки документации написанной вручную, а не автоматической генерации документации по API. Но в любом случае поддержка и таких документов существует (для возможности встраивания их в рукописный текст). Если вам нужен просто автоматический генератор API-документации обратите внимание на `Epydoc <http://epydoc.sourceforge.net/>`_, который так же работает с форматом reST.

source: For a great "introduction" to writing docs in general -- the whys and hows, see also `Write the docs`_, written by Eric Holscher.
ja: ドキュメント執筆一般に関する素晴らしい”入門書”―その理由と方法―としてEric Holscherが書いた `Write the docs `Write the docs`_ も参照してください。
ru: Великолепное "введение"в написание документации в целом - почему и как. Смотрите также `Написание документации`_, от Эрика Холшера.

source: Conversion from other systems
ja: 他のシステムからの変換
ru: Конвертация из других форматов

source: This section is intended to collect helpful hints for those wanting to migrate to reStructuredText/Sphinx from other documentation systems.
ja: このセクションでは、他のドキュメントシステムからreStructuredText/Sphinxへの移行を考えている人達へのヒントを集めています。
ru: Этот раздел предназначен для сбора полезных ссылок для тех, кто хочет перейти на reStructuredText / Sphinx из других систем документации.

source: Gerard Flanagan has written a script to convert pure HTML to reST; it can be found at the `Python Package Index <https://pypi.org/project/html2rest/>`_.
ja: Gerard FlanaganはHTMLからreSTに変換するスクリプトを作成してきました。スクリプトは `Python Package Index <https://pypi.org/project/html2rest/>`_ にあります。
ru: Джерард Фланаган написал скрипт для преобразования чистого HTML в reST; его можно найти в ' Хранилище пакетов Python <https://pypi.org/project/html2rest/>'_.

source: For converting the old Python docs to Sphinx, a converter was written which can be found at `the Python SVN repository <https://svn.python.org/projects/doctools/converter/>`_. It contains generic code to convert Python-doc-style LaTeX markup to Sphinx reST.
ja: 古いPythonのドキュメントをSphinxにコンバートするには、専用のコンバート用のツールを `PythonのSVNリポジトリ <https://svn.python.org/projects/doctools/converter/>`_ で見つけることができます。これを使えば、Python-docスタイルのLaTeXのマークアップをSphinx reSTに変換できます。
ru: Для преобразования старых документов Python в Sphinx был написан конвертер, который можно найти в репозитории Python SVN <https://svn.python.org/projects/doctools/converter/>`_. он содержит общий код для преобразования разметки LaTeX в стиле Python-doc в Sphinx reST.

source: Marcin Wojdyr has written a script to convert Docbook to reST with Sphinx markup; it is at `GitHub <https://github.com/wojdyr/db2rst>`_.
ja: Marcin WojdyrはDocbookをreST＋Sphinxマークアップに変換するスクリプトを作成しました。 `GitHub <https://github.com/wojdyr/db2rst>`_ にあります。
ru: Марчин Войдыр написал скрипт для преобразования Docbook в reST с разметкой Sphinx; он находится на ' GitHub <https://github.com/wojdyr/db2rst>'_.

source: Christophe de Vienne wrote a tool to convert from Open/LibreOffice documents to Sphinx: `odt2sphinx <https://pypi.org/project/odt2sphinx/>`_.
ja: Christophe de VienneはOpen/LibreOfficeの文章をSphinxに変換するツール `odt2sphinx <https://pypi.org/project/odt2sphinx/>`_ を作成しました。
ru: Кристоф де Вьен написал инструмент для преобразования документов Open/LibreOffice в Sphinx: `odt2sphinx <https://pypi.org/project/odt2sphinx/>`_.

source: To convert different markups, `Pandoc <https://pandoc.org/>`_ is a very helpful tool.
ja: 異なるマークアップ言語感の変換には、`Pandoc <https://pandoc.org/>`_ が非常に有用です。
ru: Для преобразования различных разметок `Pandoc <https://pandoc.org/>`_ весьма полезный инструмент.

source: Use with other systems
ja: 他のシステムと併用
ru: Использование с другими системами

source: See the :ref:`pertinent section in the FAQ list <usingwith>`.
ja: :ref:`FAQの中の関連のリスト <usingwith>` を参照してください。
ru: Смотрите :ref:`pertinent section in the FAQ list<usingwith> `.

source: Prerequisites
ja: 前提条件
ru: Предварительные требования

source: Sphinx needs at least **Python 3.6** to run. It also depends on 3rd party libraries such as docutils_ and jinja2_, but they are automatically installed when sphinx is installed.
ja: Sphinxを実行するには、少なくとも **Python 3.6** が必要です。 docutils_ や jinja2_ のようなサードパーティのライブラリにも依存しますが、sphinxをインストールすると自動的にインストールされます。
ru: Sphinx нуждается по крайней мере в **Python 3.6** для запуска. Он также зависит от сторонних библиотек, таких как docutils_ и jinja2_, но они автоматически устанавливаются при установке sphinx.

source: Usage
ja: 使用方法
ru: Использование

source: See :doc:`/usage/quickstart` for an introduction. It also contains links to more advanced sections in this manual for the topics it discusses.
ja: 導入の説明にあたっては、 :doc:`/usage/quickstart` を参照してください。このドキュメントには、説明しているそれぞれの内容に対して、発展的な内容を説明しているセクションへのリンクが含まれています。
ru: Смотри :doc:`/usage/quickstart` для введения. Он также содержит ссылки на более продвинутые разделы данного руководства по обсуждаемым в нем темам.
