Repository: NateWeiler/Resources
Catalog: Python/Projects/sphinx/sphinx-doc-translations/locale/*/LC_MESSAGES/tutorial.po
Languages: pl_pl, zh_cn

source: This is the usual layout. However, :file:`conf.py` can also live in another directory, the :term:`configuration directory`. Refer to the :program:`sphinx-build man page <sphinx-build>` for more information.
zh_cn: 这是通常的设置。然而，:file:`conf.py`也可以在其他的目录中，即:term:`配置目录`。更多信息请参考:program:`sphinx-build 手册`。
