Repository: NateWeiler/Resources
Catalog: Python/Kivy/kivy-translations/sources/*/api-kivy.animation.po
Languages: hi

source: Animation
hi: एनीमेशन

source: :class:`Animation` and :class:`AnimationTransition` are used to animate :class:`~kivy.uix.widget.Widget` properties. You must specify (minimum) a property name and target value. To use Animation, follow these steps:
hi: :class: `Animation` और :class:`AnimationTransition` को :class:`~kivy.uix.widget.Widget` के गुणों को एनीमेट/चेतन करने के लिए इस्तेमाल किया जाता है ॥ आपको (न्यूनतम) एक गुण का नाम और लक्ष्य मूल्य निर्दिष्ट करना होगा ॥ एनिमेशन का उपयोग करने के लिए, इन चरणों का पालन करें:

source: Setup an Animation object
hi: एक एनिमेशन वस्तु तैयार करें

source: Use the Animation object on a Widget
hi: एक विजेट पर एनिमेशन वस्तु का उपयोग करें

source: Simple animation
hi: सरल एनीमेशन

source: To animate a Widget's x or y position, simply specify the target x/y values where you want the widget positioned at the end of the animation::
hi: एक विजेट की x या y स्थिति एनिमेट/चेतन करने के लिए, लक्ष्य के x/y का मूल्य निर्दिष्ट करें वहां जहाँ आप एनीमेशन के अंत में विजेट तैनात चाहते हैं:

source: The animation will last for 1 second unless :data:`duration` is specified. When anim.start() is called, the Widget will move smoothly from the current x/y position to (100, 100).
hi: यदी :data:`duration` निर्दिष्ट नहीं है तो एनीमेशन की अवधि १ सेकंड की होगी ॥ जब anim.start() बुलाया जायेगा, विजेट वर्तमान x/y स्थिति से (100, 100) तक सुचारू रुप से बडेगा ॥

source: Multiple properties and transitions
hi: एकाधिक गुण और बदलाव

source: You can animate multiple properties and use built-in or custom transition functions using :data:`transition` (or `t=` shortcut). For example, to animate the position and size using the 'in_quad' transition::
hi: आप कई गुणों का चेतन/एनीमेशन कर सकते हैं और भीतर के या चुने हुये बदलाव फंक्शन का उपयोग :data:`transition` (या `t=`छोटे तरीके) के साथ कर सकते हैं ॥ उदाहरण के लिए, 'in_quad' बदलाव का उपयोग स्थिति और आकार का चेतन/एनीमेशन करने के लिए कैसे करें ::

source: Note that the `t=` parameter can be the string name of a method in the :class:`AnimationTransition` class, or your own animation function.
hi: ध्यान दें कि `t =` पैरामीटर :class:`AnimationTransition` श्रेणी , या अपके खुद के एनीमेशन फ़ंक्शन में एक विधि का स्ट्रिंग नाम हो सकता है ॥

source: Sequential animation
hi: अनुक्रमिक एनीमेशन

source: To join animations sequentially, use the '+' operator. The following example will animate to x=50 over 1 second, then animate size to (80, 80) over the next two seconds::
hi: एनिमेशन को क्रमिक रूप में शामिल करने के लिए, '+ ऑपरेटर का उपयोग करें ॥ निम्न उदाहरण १ सेकेंड मे x को ५० तक एनीमेट करेगा, फिर अगले दो सेकंड मे आकार (80, 80) तक ऐनिमेट करेगा ::

source: Parallel animation
hi: समानांतर एनीमेशन

source: To join animations in parallel, use the '&' operator. The following example will animate position to (80, 10) over 1 second, while in parallel animating the first half of size=(800, 800)::
hi: एनिमेशन को समांतर से शामिल करने के लिए, '&' ऑपरेटर के उपयोग करें ॥ निम्न उदाहरण समांतर में size=(800, 800) के पहले आधे हिस्से कौ एनिमेट करते हुये, १ सेकंड में स्थिति को (८0, १0) तक एनीमेट करेगा ::

source: Bases: :class:`kivy.event.EventDispatcher`
hi: आधार: :class:`kivy.event.EventDispatcher`

source: Create an animation definition that can be used to animate a Widget
hi: एक एनीमेशन परिभाषा बनायें जो कि एक उपकरन ऐनिमेट करने के लिए इस्तेमाल किया जा सकता हो ॥

source: Duration of the animation, in seconds
hi: एनीमेशन की अवधि, पलों(सेकंड्स) में

source: Transition function for animate properties. It can be the name of a method from :class:`AnimationTransition`
hi: गुणों के एनीमेशन/चेतन के लिए बदलाव फंक्शन :class: `AnimationTransition` में से एक विधि का नाम हो सकता है ॥

source: Fired when the animation is started on a widget
hi: यह तब बुलाया जाता है जब एनीमेशन एक विजेट पर प्रारंभ होता है

source: Fired when the animation is completed or stopped on a widget
hi: यह तब बुलाया जाता है जब एक उपकरन पर एनीमेशन पूरा होता है या रोक दिया जाता है

source: Fired when the progression of the animation is changing
hi: यह तब बुलाया जाता है जब एनीमेशन की प्रगति बदल रही हो

source: Return the duration of the animation
hi: एनीमेशन की अवधि लौटायें

source: Return the properties used to animate
hi: ऐनिमेट हेतु प्रयोगित गुण लौटायें

source: Start the animation on a widget
hi: एक उपकरन पर एनीमेशन शुरू करें

source: Stop the animation previously applied on a widget
hi: एक उपकरन पर लागू पिछलि एनीमेशन बंद करें

source: Stop all animations that concern a specific widget / list of properties.
hi: एक विशिष्ट उपकरन या गुण सूची से संबंधित सभी एनिमेशन बंद करें ॥

source: Example ::
hi: उदाहरण ::

source: Even if an animation is running, remove a property. It will not be animated further.
hi: एक एनीमेशन के चलते हुये भी, एक गुण को हटा दें. यह आगे एनिमेट नहीं होगा ॥

source: Return the transition of the animation
hi: एनीमेशन के परिवर्तन लौटायें

source: Bases: :class:`object`
hi: आधार: :class:`object`

source: Collection of animation function, to be used with Animation object. Easing Functions ported into Kivy from Clutter Project http://www.clutter-project.org/docs/clutter/stable/ClutterAlpha.html
hi: एनिमेशन वस्तु के साथ इस्तेमाल किये जाने वाले एनीमेशन फंकशन का संग्रह, Clutter http://www.clutter-project.org/docs/clutter/stable/ClutterAlpha.html से Kivy में फंकशन लाने की कार्य सहजता के लिये ॥

source: `progress` parameter in each animation functions is between 0-1 range.
hi: प्रत्येक एनीमेशन कार्यों में `progress` पैरामीटर 0-1 रेंज के बीच है ॥
