Repository: NateWeiler/Resources
Catalog: Python/Kivy/kivy-translations/sources/*/api-kivy.clock.po
Languages: hi

source: Clock object
hi: घड़ी उपकर्ण

source: The :class:`Clock` object allows you to schedule a function call in the future; once or on interval. ::
hi: वर्ग :class:`Clock` वस्तु आपको भविष्य में एक समारोह को अनुसूची से बुलाने की अनुमति देता है, एक बार या अंतराल पर. :

source: If the callback returns False, the schedule will be removed.
hi: यदि कॉलबैक का परिणाम हो False तो यह अनुसूची से हटा दिया जाएगा.

source: Schedule before frame
hi: फ्रेम से पहले का अनुसूचि तय करें

source: Sometimes you need to schedule a callback BEFORE the next frame. Starting from 1.0.5, you can use a timeout of -1::
hi: कभी कभी अगले फ्रेम से पहले एक कॉलबैक अनुसूची की जरूरत होती है. 1.0.5 से , -1 का एक अंतराल का उपयोग कर सकते हैं::

source: The Clock will execute all the callbacks with a timeout of -1 before the next frame, even if you add a new callback with -1 from a running callback. However, :class:`Clock` has an iteration limit for these callbacks, it defaults to 10.
hi: घड़ी -१ के एक अंतराल वाले सभी कालबैक अगले फ्रेम से पहले अमल करेगी । अगर आप चल रहे एक कॉलबैक से -१ के साथ एक नया कॉलबैक जोड़ें तो भी ॥ जैसे भी, वर्ग :class:`Clock` में इन कालबैक के लिए एक चलित सीमा होती है जो डिफाल्ट के तौर पर १० है ॥

source: If you schedule a callback that schedules a callback that schedules a .. etc more than 10 times, it will leave the loop and send a warning to the console, then continue after the next frame. This is implemented to prevent bugs from hanging or crashing the application.
hi: यदि आप एक कॉलबैक कि अनुसूची करते हैं जो एक कॉलबैक कि अनुसूची करता है जो एक कॉलबैक कि अनुसूची करता है .. आदि १० से अधिक बार । यह पाश छोड़कर एक चेतावनी भेजेगा कौन्सोल पर, फिर अगले फ्रेम के बाद आगे बड़ेगा ॥ एसा इसलिये स्थापित है ताकि ब्गस/कीड़े अनुप्रयोग को हैंग(फांस) या क्रेश(दुर्घटनाग्रस्त) न कर सकें ॥

source: If you need to increase the limit, set the :data:`max_iteration` property::
hi: यदि सीमा बढ़ाने की जरूरत है तो :data:`max_iteration` property:: रूपरेखा को स्थापित करें

source: Triggered Events
hi: शुरु की गइ घटनाएँ

source: A triggered event is a way to defer a callback exactly like schedule_once(), but with some added convenience. The callback will only be scheduled once per frame, even if you call the trigger twice (or more). This is not the case with :func:`Clock.schedule_once` ::
hi: एक शुरु की गइ घटना (schedule_once) की तरह वास्तव में एक कॉलबैक स्थगित करने का एक तरीका है । लेकिन कुछ जुड़ि सुविधाों के साथ ॥ कॉलबैक प्रति फ्रेम केवल एक बार अनुसूचित किया जाएगा, भले ही आप ट्रिगर दो बार (या अधिक) बुलायें ॥ समारोह :func:`Clock.schedule_once` :: के साथ ऐसा नहीं है ::

source: Before triggered events, you may have used this approach in a widget ::
hi: शुरु की गइ घटनाओं से पहले, आपने इस दृष्टिकोण को एक विजेट में उपयोग किया हो सकता है::

source: As soon as you call `trigger_callback()`, it will correctly schedule the callback once in the next frame. It is more convenient to create and bind to the triggered event than using :func:`Clock.schedule_once` in a function ::
hi: जैसे ही आप `trigger_callback()` बुलाते हैं यह सही ढंग से अगले फ्रेम में कॉलबैक एक बार अनुसूचित करेगा ॥ ट्रिगर घटना को बनाकर बाध्य करना अधिक सुविधाजनक है समारोह :func:`Clock.schedule_once` का समारोह में उपयोग करने से ::

source: Even if x and y changes within one frame, the callback is only run once.
hi: एक फ्रेम के भीतर x और y परिवर्तित होने के बावजूद कॉलबैक केवल एक बार चलता है ॥

source: :func:`Clock.create_trigger` also has a timeout parameter that behaves exactly like :func:`Clock.schedule_once`.
hi: :func:`Clock.create_trigger` के पास भी एक अंतराल पैरामीटर है जोकि ठीक वेसे ही बर्ताव करता है जैसे :func:`Clock.schedule_once` ॥

source: Instance of the ClockBase, available for everybody
hi: सबके लिए उपलब्ध ClockBase का प्रसिरूप

source: Bases: :class:`object`
hi: आधार: :class:`object`

source: A clock object with event support
hi: घटना समर्थन के साथ एक घड़ी वस्तु

source: Create a Trigger event. Check module documentation for more information.
hi: एक ट्रिगर घटना बनाएँ. अधिक जानकारी के लिए मॉड्यूल दस्तावेज़ीकरण की जाँच करें ॥

source: Time spent between last frame and current frame (in seconds)
hi: अंतिम फ्रेम और वर्तमान फ्रेम के बीच बिताया समय (सेकंड में)

source: Get time in seconds from the application start
hi: अनुप्रयोग के शुरू से सेकंड में समय प्राप्त करें

source: Get the current average FPS calculated by the clock
hi: घड़ी द्वारा गणित मौजूदा औसत FPS प्राप्त करें

source: Get the current "real" FPS calculated by the clock. This counter reflects the real framerate displayed on the screen.
hi: घड़ी द्वारा गणित वर्तमान "वास्तविक"FPS प्राप्त करें ॥ यह गणनायंत्र स्क्रीन पर प्रदर्शित वास्तविक फ्रेमरेट को दर्शाता है ॥

source: In contrast to get_fps(), this function returns a counter of the number of frames, not an average of frames per second
hi: Get_fps() के विपरीत, यह समारोह फ्रेम की संख्या का एक काउंटर लौटाता है । न की फ्रेम प्रति सेकंड के एक औसत

source: Get the last tick made by the clock
hi: घड़ी द्वारा बनाया पिछला टिक प्राप्त करें

source: Schedule an event to be called every <timeout> seconds
hi: एक घटना हर <अंतराल> सेकंड्स बुलाने के लिए अनुसूचीत करें

source: Schedule an event in <timeout> seconds.
hi: <अंतराल> सेकंड्स में एक घटना अनुसूचीत करें

source: Advance clock to the next step. Must be called every frame. The default clock have the tick() function called by Kivy
hi: अगले कदम के लिए घड़ी अग्रिम करें ॥ हर फ्रेम से बुलाया जाना चाहिए ॥ डिफ़ॉल्ट घड़ी का tick() समारोह Kivy द्वारा बुलाया जाता है ॥

source: Tick the drawing counter
hi: ड्राइंग काउंटर टिक करें

source: Remove a previously scheduled event.
hi: एक पहले से अनुसूचित घटना हटाएंं
