Repository: NateWeiler/Resources
Catalog: Python/Kivy/kivy-translations/sources/*/api-kivy.app.po
Languages: hi

source: Application
hi: अनुप्रयोग

source: The :class:`App` class is the base for creating Kivy applications. Think of it as your main entry point into the Kivy run loop. In most cases, you subclass this class and make your own app. You create an instance of your specific app class and then, when you are ready to start the application's life cycle, you call your instance's :func:`App.run` method.
hi: वर्ग: `App` Kivy अनुप्रयोगों के बनाने के लिए आधार है ॥ Kivy रन लूप में अपने मुख्य प्रवेश बिंदु के रूप में इसके बारे में सोचें । ज्यादातर मामलों में; आप इस वर्ग का उपवर्ग करें और अपने खुद के अनुप्रयोग में उपयोग करें ॥ आप अपने विशिष्ट अनुप्रयोग वर्ग का एक प्रतिबिंब बनायें और तब; जब आप अनुप्रयोग जीवन चक्र शुरू करने के लिए तैयार हों; तो आप अपने प्रतिबिंब का फंकशन: `App.run` विधि बुल्यें ॥

source: Creating an Application
hi: एक अनुप्रयोग बनाना

source: Method using build() override
hi: build() अध्यारोह का उपयोग करती विधि

source: To initialize your app with a widget tree, override the build() method in your app class and return the widget tree you constructed.
hi: एक विजेट के पेड़ के साथ अपना अनुप्रयोग प्रारंभ करने के लिए, build() विधि अपने app वर्ग में अध्यारोहित करें और अपने दवारा निर्मित विजेट पेड़ वापस लैटाएं ॥

source: Here's an example of very simple application that just shows a button:
hi: यहाँ उदाहरण है एक बहुत ही सरल अनुप्रयोग का जो सिर्फ एक बटन दिखाता है ॥

source: The file is also available in the examples folder at :file:`kivy/examples/application/app_with_build.py`.
hi: यह फाइल उदाहरण 'examples' फ़ोल्डर में भी उपलब्ध है :file: `kivy/examples/application/app_with_build.py`.

source: Here, no widget tree was constructed (or if you will, a tree with only the root node).
hi: यहाँ, किसि विजेट पेड़ का निर्माण नहिं किया गया (या फिर कहैं की, एक पेड़ केवल रूट नोड के साथ) ॥

source: Method using kv file
hi: kv फ़ाइल का उपयोग कर विधि

source: You can also use the :doc:`api-kivy.lang` for creating application. The .kv can contain rules and root widget definitions at the same time. Here is the same example as the Button one in a kv file.
hi: आप :doc:`api-kivy.lang` का भी उपयोग कर सकते हैं अपने अनुप्रयोग के निमृाण के लीये॥ केवी.(.kv)में एक ही समय में नियम और जड़ विजेट परिभाषाएँ शामिल कर सकते हैं ॥ यहाँ वही बटन वाला उदाहरण है एक kv फ़ाइल में ॥

source: Contents of 'test.kv':
hi: 'test.kv' के भीतर की सूची:

source: Contents of 'main.py':
hi: 'main.py' के भीतर की सूची:

source: See :file:`kivy/examples/application/app_with_kv.py`.
hi: फ़ाइल :file:`kivy/examples/application/app_with_kv.py`देखिये ॥

source: The relation between main.py and test.kv is explained in :func:`App.load_kv`.
hi: main.py और test.kv के बीच का संबंध फंक्शन :func:`App.load_kv` में समझाया गया है ॥

source: Application configuration
hi: अनुप्रयोग विन्यास

source: Use the configuration file
hi: विन्यास फाइल का प्रयोग करें

source: Your application might want to have his own configuration file. The :class:`App` is able to handle a INI file automatically. You add your section/key/value in the :meth:`App.build_config` method by using the `config` parameters (instance of :class:`~kivy.config.ConfigParser`::
hi: हो सकता है अपका अनुपृयोग अपने लिए विन्यास फाइल का उपयोग करना चाहता हो ॥ :class: `App` एक INI फ़ाइल स्वचालित रूप से संभालने में सक्षम है ॥ आप `config` पैरामीटर (जो कि वृग :class:`~kivy.config.ConfigParser`:: का पृतिरूप है) का उपयोग कर विधि :meth:`App.build_config` में अपने अनुभाग(सेक्शन) / कुंजी(की) / मूल(वेल्यु) जोड़ सकते हैं ॥

source: As soon as you will add one section in the config, a file will be created on the disk, and be named from the mangled name of your class: "TestApp" will give a config filename "test.ini" with the content::
hi: जैसे ही आप कन्फिग में एक अनुभाग(सेक्शन) जोड़ देंगे, अपके वर्ग के टूटे नाम से एक फ़ाइल डिस्क पर निर्मित की जाएगी, और "TestApp" एक "test.ini" नामक कन्फिग फ़ाइल देगा जिसकी अंतर्निहित वस्तुएं होंगी::

source: The "test.ini" will be automatically loaded at runtime, and you can access to the configuration in your :meth:`App.build` method::
hi: "Test.ini" स्वचालित रूप से चालित-वक्त(रन-टाइम) में लोड हो जाएगी, और आप अपनी विधि :meth:`App.build` में "Test.ini" की व्यवस्था का उपयोग कर सकते हैं ::

source: Create a settings panel
hi: रूपरेखा पट्टिका बनाएँ

source: Your application can have a settings panel to let your user configure some of your config tokens. Here is an example done in the KinectViewer example (available in the examples directory):
hi: आपका अनुपृयोग एक रूपरेखा पट्टिका का उपयोग कर आपने उपयोगकर्ता को आपने कुछ कॉन्फ़िग टोकन व्यवस्थित करने दे सकता है ॥ यहाँ एक उदाहरण है (examples निर्देशिका/डायरेक्टरी में उपलब्ध) KinectViewer में::

source: You have the possibility to extends the default application settings with your own panel by extending the :meth:`App.build_settings` method. Check the :class:`~kivy.uix.settings.Settings` about how to create a panel, because you need a JSON file / data first.
hi: आप विधि :meth:`App.build_settings` का विस्तार कर अपनी खुद की पट्टिका के साथ आप डिफ़ॉल्ट अनुप्रयोग की रूपरेखा का विस्तार कर सकते हैं ॥ एक रूपरेखा पट्टी कैसे बनाएं जानने के लीए वर्ग :class:`~kivy.uix.settings.Settings` में देखें, चूंकी अपको JSON फ़ाइल/डेटा की पहले आवष्यकता होगि ॥

source: Let's take as an example the previous snippet of TestApp with custom config. We could create a JSON like this::
hi: चलो एक उदाहरण के रूप में पिछले टुकड़े TestApp को चुनिंदा व्यवस्था/कन्फिग के साथ रखें. हम इस तरह एक JSON बना सकते हैं:

source: Then, we can create a panel using this JSON to create automatically all the options, and link them to our :data:`App.config` ConfigParser instance::
hi: फिर, हम स्वचालित रूप से सभी विकल्पों को बनाने के लिए इस JSON का उपयोग कर पैनल बना सकते हैं , और उन्हें हमारे :data:`App.config` ConfigParser पृतिरूप से जोड़ सकते हैं ::

source: That's all ! Now you can press F1 (default keystroke) for toggle the settings panel, or press the "settings" key on your android device. You can manually call :meth:`App.open_settings` and :meth:`App.close_settings` if you want. Every changes in the panel are automatically saved in the config file.
hi: बस ! अब आप सेटिंग्स पैनल को बदलने के लिए F1 (डिफ़ॉल्ट कीस्ट्रोक) दबाएँ, या अपने एंडरोय्ड उपकरण पर "settings" कुंजी प्रेस कर सकते हैं ॥ अगर आप चाहें तो आप खुद विधि :Meth:App.open_settings` और विधि :meth:` App.close_settings` बुला सकते हैं ॥ पट्टि/पैनल में हर परिवर्तन स्वचालित रूप से कंफिग फाइल में सहेजा जाता है ॥

source: However, you might want to know when a config value have been changed by the user, in order to adapt or reload your UI. You can overload the :meth:`on_config_change` method::
hi: अगर आप जानना चाहते हैं की व्यवस्था/कंफ्गि मूल्य कब बदला ? ताकी आप अपने GUI को उसके हिसाब से बदल सकें तो आप विधी meth:`on_config_change` को ओवरलोड कर सकते हैं ॥

source: One last note, the Kivy configuration panel is added by default in the settings instance. If you don't want it, you can declare your Application like this::
hi: ध्यान दें, Kivy विन्यास(कंफिगयुरेशन) पट्टी; व्यवस्था(सेटिंग्स) पर्तिरूप में डिफ़ॉल्ट रूप से जोड़ा जाता है ॥ यदि आप यह नहीं चाहते हैं, तो आप इस तरह अपने अनुप्रयोग की घोषणा कर सकते हैं::

source: Bases: :class:`kivy.event.EventDispatcher`
hi: आधार: :class:`kivy.event.EventDispatcher`

source: Application class, see module documentation for more information.
hi: अनुप्रयोग वर्ग, अधिक जानकारी के लिए मॉड्यूल के दस्तावेज़ देखें ॥

source: Fired when the application is being started (before the :func:`~kivy.base.runTouchApp` call.
hi: यह तब बुलाया जाता है जब अनुप्रयोग शुरू किया जा रहा हो। फंक्शन :func:`~kivy.base.runTouchApp` को बुलाने से पहले ॥

source: Fired when the application stops.
hi: यह तब बुलाया जाता है जब अनुप्रयोग शुरू रोका जा रहा हो ॥

source: If a kv_directory is set, it will be used to get the initial kv file. By default, the file is searched in the same directory as the current App definition file.
hi: यदि एक kv_directory स्थापित है, यह प्रारंभिक केवी फाईल को पाने के लिए इस्तेमाल की जाएगी ॥ डिफ़ॉल्ट रूप से, फ़ाइल उस निर्देशिका में खोजी जाती है जिसमें वर्तमान App परिभाषा फ़ाइल है.

source: Initializes the application; will be called only once. If this method returns a widget (tree), it will be used as the root widget and added to the window.
hi: अनुप्रयोग आरंभ करता है; केवल एक बार बुलाया जाएगा॥ यदि यह विधि एक विजेट (वृक्ष) लौटाती है, तो यह रूट विजेट के रूप मे इस्तेमाल किया जाएगा और खिड़की(window) को जोडा जायेगा ॥

source: This method is called before the application is initialized to construct your :class:`~kivy.config.ConfigParser` object. This is where you can put any default section / key / value for your config. If anything is set, the configuration will be automatically saved in the file returned by :meth:`get_application_config`.
hi: यह विधी आपका अनुप्रयोग आरंभ होने से पेहले बुलायी जाती है वर्ग :class:`~kivy.config.ConfigParser` का वस्तु/औबजेक्ट बनाने के लीये ॥ यह वह जगह है जहाँ आप किसी भी डिफ़ॉल्ट अनुभाग / कुंजी / मान को अपनी कॉन्फिग के लिए रख सकते हैं ॥ यदि कुछ भी स्थित कर दिया जाता है, विन्यास स्वतः विधी : meth :`get_application_config` द्वारा लौटाए फ़ाइल में सहेजा जाएगा॥

source: This method is called when the user (or you) want to show the application settings. This will be called only once, the first time when the user will show the settings.
hi: जब उपयोगकर्ता (या आप) इस नुप्रयोग की व्यवस्था को दिखाना चाहते हौं तब इस विधि को बुलाया जाता है ॥ इसे केवल एक बार बुलाया जाएगा, जब उपयोगकर्ता पहली बार सेटिंग्स दिखाएगा ॥

source: Close the previously opened settings panel.
hi: पहले खोली व्यवस्था पट्टी बंद करें ॥

source: Instance to the :class:`~kivy.config.ConfigParser` of the application configuration. Can be used to query some config token in the build()
hi: अनुप्रयोग विन्यास के वर्ग :class:`~kivy.config.ConfigParser` का प्रतिरूप build() में से कुछ व्यवस्था प्रतीक प्रशन करने के लिए इस्तेमाल किया जा सकता है ॥

source: Return the directory where the application live
hi: वह निर्देशिका लौटायें जहाँ अनुप्रयोग चल रहा है

source: Return the filename of your application configuration
hi: आपके अनुप्रयोग की व्यवस्था का दस्तावेज़ नाम लौटायें

source: Return the icon of the application.
hi: अनुप्रयोग का आइकन/चिह्न लौटायें ॥

source: Return the name of the application.
hi: अनुप्रयोग का नाम लौटियें ॥

source: Icon of your application. You can set by doing::
hi: आप अनुप्रयोग का चिह्न/आइकन यूं रख कर सकते हैं::

source: The icon can be located in the same directory as your main file.
hi: चिह्न(आइकन) व मुख्य फ़ाइल एक ही निर्देशिका में स्थित किये जा सकते हैं ॥

source: (internal) This function is used for returning a ConfigParser with the application configuration. It's doing 3 things:
hi: (आंतरिक) यह समारोह अनुप्रयोग विन्यास के साथ एक ConfigParser लौटने के लिए प्रयोग किया जाता है ॥ यह ३ चीज़ें कर रहा है:

source: Create an instance of a ConfigParser
hi: ConfigParser का एक प्रतिरूप बनाएँ

source: Load the default configuration by calling :meth:`build_config`, then
hi: विधी :meth:`build_config` को बुलाकर डिफ़ॉल्ट व्यवस्था लोड करें । फिर

source: If exist, load the application configuration file, or create it if it's not existing.
hi: अगर मौजूद है, अनुप्रयोग व्यवस्था गस्तावेज़ लोड करें , या इसे बनाएँ अगर यह नहीं मौजूदा है ॥

source: This method is invoked the first time the app is being run if no widget tree has been constructed before for this app. This method then looks for a matching kv file in the same directory as the file that contains the application class.
hi: यह विधि अनुप्रयोग के पहली बार चालू होने पर लागु होती हे। अगर कोई विजेट पेड़ इस अनुप्रयोग के लिए पहले निर्मित नही किया गया है तो यह विधि एक मेल खाती केवी(.kv) फ़ाइल के लिए उस निर्देशिका में ढूडता है जिसमें अनुप्रयोग वर्ग की फ़ाइल है ॥

source: For example, if you have a file named main.py that contains::
hi: उदाहरण के लिए, यदि आप के पास main.py नाम की एक फ़ाइल है जिसमें:

source: This method will search for a file named `showcase.kv` in the directory that contains main.py. The name of the kv file has to be the lowercase name of the class, without the 'App' postfix at the end if it exists.
hi: यह विधि एक showcase.kv नाम की फ़ाइल के लिए उस निर्देशिका में खोजेगी `जिसमे main.py है ॥

source: You can define rules and a root widget in your kv file::
hi: आप अपने केवी फ़ाइल में नियमों और एक जड़ विजेट को परिभाषित कर सकते हैं::

source: There must be only one root widget. See the :doc:`api-kivy.lang` documentation for more information on how to create kv files. If your kv file contains a root widget, it will be used as self.root, the root widget for the application.
hi: वहाँ सिर्फ एक ही जड़ विजेट होना चाहिए। केवी फ़ाइलों को कैसे बनायें व अधिक जानकारी के लिए देखें प्रलेखन :doc:`api-kivy.lang`। यह self.root रूप में, अनुप्रयोग के मूल विजेट के लीये इस्तेमाल किया जाएगा ॥

source: Return the name of the application, based on the class name
hi: वर्ग के नाम पर आधारित अनुप्रयोग का नाम लौटाएँ

source: Event handler fired when one configuration token have been changed by the settings page.
hi: घटना प्रहस्तक तब बुलाया जाता है जब एक व्यवस्था प्रतीक रूपरेखा पृष्ठ के द्वारा बदल दिया गया हो ॥

source: Event handler for the on_start event, which is fired after initialization (after build() has been called), and before the application is being run.
hi: घटना प्रहस्तक On_start घटना के लिए जो कि शूरूात में build() को बूलाने के बाद और अनुप्रयोग के चलने से पहले बुलाया जाता है ॥

source: Event handler for the on_stop event, which is fired when the application has finished running (e.g. the window is about to be closed).
hi: घटना प्रहस्तक On_सटोप घटना के लिए जो कि अनुप्रयोग के रुकने पर बुलाया जाता है (उदाहरणार्थ खिड़की बंद होने वाली हो) ॥

source: Open the application settings panel. It will be created the very first time. Then the settings panel will be added to the Window attached to your application (automatically done by :meth:`run`)
hi: अनुप्रयोग व्यवस्था पट्टी खोलें । सबसे पहले बार यह निर्मित कीया जायेगा फिर आपके अनुप्रयोग से जुडि खिडकी के साथ व्यवस्था पट्टी जोडी जायेगी (स्वचलित रूप से विधी :meth:`run` द्वारा कार्यक्रित)

source: Options passed to the __init__ of the App
hi: अनुप्रयोग के __init__ को पारित करने के लिए विकल्प

source: Root widget set by the :func:`build` method or by the :func:`load_kv` method if the kv file contains a root widget.
hi: जड़ विजेट फंकशन :func:`build` विधि द्वारा निर्धारित होता है या :func:`load_kv` विधि द्वारा अगर केवी फ़ाइल में जड़ विजेट हो ॥

source: Launches the app in standalone mode.
hi: स्वसंपूर्ण तरीके से अनुप्रयोग की शुरूआत करता है ॥

source: Stop the application.
hi: अनुप्रयोग बंद करो ॥

source: If you use this method, the whole application will stop by issuing a call to :func:`~kivy.base.stopTouchApp`.
hi: यदि आप इस विधि का उपयोग करते है तो पूरा अनुप्रयोग फंकशन :func:`~kivy.base.stopTouchApp` जारी करके बंद हो जाएगा ॥

source: Title of your application. You can set by doing::
hi: आपने अनुप्रयोग के शीर्षक को यूं स्थित कर सकते हैं::

source: If True, the application settings will include also the Kivy settings. If you don't want the user to change any kivy settings from your settings UI, change this to False.
hi: अगर True, Kivy की व्यवस्था अनुप्रयोग की व्यवस्था के बीच होंगी ॥ अगर आप नहीं चाहते की उपयोगकर्ता आपकी व्यवस्था पट्टी से Kivy की व्यवस्था बगल सके तो इसे False में बदल दें ॥
