Repository: NateWeiler/Resources
Catalog: Python/Kivy/kivy-translations/sources/*/api-kivy.cache.po
Languages: hi, pt

source: Cache manager
hi: संजोह प्रबंधक
pt: Gerenciador de cache

source: The cache manager can be used to store python object attached to an uniq key. The cache can be controlled in different manner, with a object limit or a timeout.
hi: संजोह प्रबंधक एक अद्वितीय कुंजी से जुडे पाय्थोन वस्तु के संग्नह के लिए इस्तेमाल किया जा सकता है ॥ संजोहक एक वस्तु की सीमा या एक अंतराल के साथ अलग तरीके से नियंत्रित किया जा सकता है ॥
pt: O gerenciador de cache pode ser usado para armazenar um objeto python ligado a uma chave única. O cache pode ser controlado de maneira diferente, com um limite de objeto ou um limite de tempo.

source: For example, we can create a new cache with a limit of 10 objects and a timeout of 5 seconds::
hi: उदाहरण के लिए, हम 10 वस्तुओं की एक सीमा और 5 सेकंड के अंतराल के साथ एक नया संजोहक बना सकते हैं::
pt: Por exemplo, nós podemos criar um novo cache com um limite de 10 objetos e um limite de tempo de 5 segundos::

source: If the instance is NULL, the cache may have trash it, because you've not used the label since 5 seconds, and you've reach the limit.
hi: यदि प्रतिरूप NULL है तो हो सकता है संजोहक ने इसे खत्म कर दिया हो, क्योंकि आपने 5 सेकंड से लेबल का उपयोग नहीं किया है, और आप सीमा तक पहुँच चुके है ॥
pt: Se a instância é NULL, o cache pode ter lixo, porque você não usou o rótulo por 5 segundos, e você atingiu o limite.

source: Bases: :class:`object`
hi: आधार: :class:`object`
pt: Bases: :classe:`objeto`

source: See module documentation for more information.
hi: अधिक जानकारी के लिए मॉड्यूल के दस्तावेज़ देखें.
pt: Veja a documentação do módulo para mais informações.

source: Add a new object in the cache.
hi: कैश में एक नया उपकर्ण जोड़ें ॥
pt: Adiciona um novo objeto no cache.

source: Identifier of the category
hi: श्रेणी के पहचानकर्ता
pt: Identificador da categoria

source: Uniq identifier of the object to store
hi: सहेजने वाले वस्तु का अद्वतीय पहचानकर्ता
pt: Identificador Uniq do objeto a ser guardado

source: Object to store in cache
hi: संजोहक में संग्रहीत करने के लिए उपकर्ण
pt: Objeto a guardar no cache

source: Custom time to delete the object if it's not used.
hi: उपकर्ण को हटाने के लिए कस्टम समय; अगर इसे इस्तेमाल नहीं किया है ॥
pt: Customizar tempo para deletar o objeto se ele não for usado.

source: Get a object in cache.
hi: संजोहक में से उपकर्ण प्राप्त करें ॥
pt: Pegar um objeto no cache.

source: Default value to be returned if key is not found
hi: डिफ़ॉल्ट मान लौटाया जाएगा अगर कुंजी नहीं मिलती है ॥
pt: Valor padrão a ser retornado caso a chave não seja encontrada

source: Get the object last access time in cache.
hi: उपकर्ण का संजोहक में अंतिम उपयोग समय प्राप्त करें ॥
pt: Pegar o último tempo de acesso do objeto no cache.

source: Get the object timestamp in cache.
hi: संजोहक में से उपकर्ण का टाइमस्टैम्प प्राप्त करें ॥
pt: Pegar a marcação de tempo do objeto no cache.

source: Print the cache usage on the console
hi: कोंसोल पर संनजोहक का उपयोग मान छापें
pt: Imprimir o uso do cache no console

source: Register a new category in cache, with limit
hi: संजोहक में एक नई श्रेणी सीमा के साथ, पंजिक्रित करें
pt: Registrar uma nova categoria no cache, com um limite

source: Maximum number of object in the cache. If None, no limit is applied.
hi: संजोहक में अधिकतम उपकर्णों की संख्या ॥ अगर None है तो कोई सीमा नहीं लागू होगी ॥
pt: Número máximo de objetos no cache. Se for None, nenhum limite é aplicado.

source: Time to delete the object when it's not used. if None, no timeout is applied.
hi: उपकर्ण इस्तेमाल न होने पर इसे हटाने से पहले का समय अंतराल । अगर None है तो कोई समय अंतराल लागू नहीं किया जाता ॥
pt: Tempo para deletar o objeto quando ele não é usado. Se None, nenhum limite de tempo é aplicado.

source: Purge the cache
hi: संजोहक खत्म करें
pt: Limpar o cache
