Repository: NateWeiler/Resources
Catalog: Python/Kivy/kivy-translations/sources/*/api-kivy.*.po
Languages: hi

source: Event loop management
hi: घटना लूप प्रबंधन

source: EventLoop instance
hi: EventLoop प़तिबिंब

source: Bases: :class:`kivy.event.EventDispatcher`
hi: आधार: :class:`kivy.event.EventDispatcher`

source: Main event loop. This loop handle update of input + dispatch event
hi: मुख्य घटना पाश(लूप) ॥ यह पाश इनपुट + प्रेषण घटना के अद्यतन को संभालता है ॥

source: Add a new event listener for getting touch event
hi: स्पर्श घटना को प्राप्त करने के लिए एक नई घटना श्रोता जोड़ना

source: Add a new input provider to listen for touch event
hi: एक नया इनपुट प्रदाता जोड़ें स्पर्श घटना सुनने के लिए ॥

source: Add a postproc input module (DoubleTap, RetainTouch are default)
hi: एक postproc इनपुट मॉड्यूल जोड़ें (DoubleTap, RetainTouch डिफ़ॉल्ट हैं)

source: Exit from the main loop, and stop all configured input providers.
hi: मुख्य पाश से बाहर निकलें, और सभी स्थित इनपुट प्रदाताओं को बंद करें ॥

source: Called by idle() to read events from input providers, pass event to postproc, and dispatch final events.
hi: idle() द्वारा इनपुट प्रदाताओं से घटनाओं को पढ़ने के लिए बुलाया जाता है, postproc को घटना पारित करें और अंतिम घटनाओं को प्रेषण करें ॥

source: Ensure that we have an window
hi: सुनिश्चित करें कि हमारे पास एक खिड़की है

source: Close the main loop, and close the window
hi: मुख्य पाश और खिड़की बंद करें

source: This function is called every frames. By default : * it "tick" the clock to the next frame * read all input and dispatch event * dispatch on_update + on_draw + on_flip on window
hi: यह समारोह हर फ्रेम बुलाया जाता है ॥ डिफ़ॉल्ट रूप से: * यह घड़ी को अगले फ्रेम तक "टिक" करता है * सभी इनपुट और प्रेषण घटना पढ़ें * on_update + on_draw + खिड़की पर on_flip प्रेषण करें

source: Event handler for on_pause, will be fired when the event loop is paused.
hi: On_pause के लिए धटना प्रहस्तक, जब घटना पाश रुका हुआ हो तब बुलाया जाएगा ॥

source: Event handler for on_start, will be fired right after all input providers have been started.
hi: On_start के लिए धटना प्रहस्तक सभी इनपुट प्रदाता शुरू होने के बाद बुलाया जायेगा ॥

source: Event handler for on_stop, will be fired right after all input providers have been stopped.
hi: On_stop के लिए धटना प्रहस्तक सभी इनपुट प्रदाता रुकने के बाद बुलाया जायेगा ॥

source: This function is called by dispatch_input() when we want to dispatch a input event. The event is dispatched into all listeners, and if grabbed, it's dispatched through grabbed widgets
hi: यह समारोह dispatch_input () के द्वारा बुलाया जाता है तब जब हम एक इनपुट घटना प्रेषण करना चाहते हैं ॥ घटना सभी श्रोताओं को भेजी जाती है, और उन उपकर्णों के माध्यम से जिन्हौंने यह घटना पकड़ी हुइ है इसे प्रेषित किया जाता है ॥

source: Remove a event listener from the list
hi: एक घटना श्रोता को सूची से निकालें

source: Remove an input provider
hi: एक इनपुट प्रदाता निकालें

source: Remove a postproc module
hi: Postproc मॉड्यूल निकालें

source: Main loop
hi: मुख्य पाश

source: Set the window used for event loop
hi: घटना पाश के लिए इस्तेमाल की खिड़की स्थित करें

source: Must be call only one time before run(). This start all configured input providers.
hi: केवल एक बार बुलाया जाना चाहिए run() से पहले ॥ यह सभी व्यवस्थित इनपुट प्रदाताओं को शुरू करता है ॥

source: Stop all input providers and call callbacks registered using EventLoop.add_stop_callback()
hi: सभी इनपुट प्रदाता रोकें और विधी :meth:EventLoop.add_stop_callback() द्वारा पंजीकृत callbacks बुलायें ॥

source: Return the list of all touches currently in down or move state
hi: वर्तमान में सभी दबे या चल्ति रूप स्पर्शों की सूची लौटियें

source: Kivy Exception Manager instance
hi: Kivy Exception Manager प्रतिबिंब

source: Base handler that catch exception in runTouchApp(). You can derivate and use it like this ::
hi: कोष प्रहस्तक जो कि runTouchApp () में अपवाद पकडता हैं ॥ आप इसको बदलकर यूं इसका इस्तेमाल कर सकते हैं ::

source: All exceptions will be set to PASS, and logged to console !
hi: सभी अपवाद पारित करने के लिए निर्धारित हो जाएंगे और टर्मिनल पर लेखा जोता जायेगा !

source: Handle one exception, default return ExceptionManager.STOP
hi: एक अपवाद संभालें, डिफ़ॉल्ट वापसी ExceptionManager.STOP

source: Static main function that starts the application loop. You got some magic things, if you are using argument like this :
hi: अनुप्रयोग पाश शुरू करने वाला स्थिर मुख्य समारोह ॥ आपको कुछ जादूइ चीजें मिल गयी है, अगर आप इस तरह से तर्क का उपयोग कर रहे हैं:

source: To make dispatching work, you need at least one input listener. If not, application will leave. (MTWindow act as an input listener)
hi: काम प्रेषण करने के लिए, आपको कमस्कम एक इनपुट श्रोता की जरूरत है । यदि नहीं, तो अनुप्रयोग रुक जायेगा ॥ (MTWindow एक इनपुट श्रोता के रूप में कार्यरत है)

source: If you pass only a widget, a MTWindow will be created, and your widget will be added on the window as the root widget.
hi: यदि आप केवल एक विजेट पारित करते हैं, एक MTWindow बनाया जाएगा और अपका विजेट जड़ विजेट के रूप में खिड़की पर जोड़ दिया जाएगा.

source: No event dispatching are done. This will be your job.
hi: कोइ भी घटना प्रेषित नहीं की जाएगी ॥ यह आपका काम होगा ॥

source: No event dispatching are done. This will be your job, but we are trying to get the window (must be created by you before), and add the widget on it. Very usefull for embedding Kivy in another toolkit. (like Qt, check kivy-designed)
hi: कोइ भी घटना प्रेषित नहीं की जाएगी ॥ यह आपका काम होगा, लेकिन हम विंडो (आपके द्वारा पहले बनाया जाना चाहिए) पाने और उस पर विजेट जोड़ें की कोशिश कर रहे हैं ॥ अन्य औज़ार-पेटी(टूलकिट) में Kivy अंत: स्थापन(एम्बेड) के लिए बहुत उपयोगी है. ( Qt, की तरह जांचें, kivy-designed)

source: Stop the current application by leaving the main loop
hi: मुख्य पाश को छोड़ कर मौजूदा अनुप्रयोग बंद करें
