Repository: NateWeiler/Resources
Catalog: Python/Kivy/kivy-translations/sources/*/contribute.po
Languages: fr

source: Contributing
fr: Contribuer

source: There are many ways in which you can contribute to Kivy. Code patches are just one thing amongst others that you can submit to help the project. We also welcome feedback, bug reports, feature requests, documentation improvements, advertisement & advocating, testing, graphics contributions and many different things. Just talk to us if you want to help, and we will help you help us.
fr: Il y a beaucoup de moyens de contribuer à Kivy. Les patches sont un des moyens parmis d'autres que vous pouvez soumettre pour aider le projet. Nous apprécions un bonjour, des rapports de bugs, de demandes d'améliorations, des corrections de documentation, de la pub, des tests, des contributions graphiques et pleins d'autres. Venez nous parler si vous voulez aider, et nous seront ravis de pouvoir vous aider.

source: Feedback
fr: Retour utilisateur

source: This is by far the easiest way to contribute something. If you're using Kivy for your own project, don't hesitate sharing. It doesn't have to be a high-class enterprise app, obviously. It's just incredibly motivating to know that people use the things you develop and what it enables them to do. If you have something that you would like to tell us, please don't hesitate. Screenshots and videos are also very welcome! We're also interested in the problems you had when getting started. Please feel encouraged to report any obstacles you encountered such as missing documentation, misleading directions or similar. We are perfectionists, so even if it's just a typo, let us know.
fr: C'est la manière la plus simple de contribuer. Si vous utiliser Kivy dans votre projet, n'hésitez pas à le dire. Ce n'est pas nécessaire d'avoir une application super tip-top bien sûr. Il est juste extrèmement motivant de voir les gens utiliser notre travail, et découvrir de nouvelles applications. Si vous avez quoi que ce soit à partager, n'hésitez pas. Les captures d'écrans et vidéos sont également les bienvenues! Nous sommes aussi intéressés aux problèmes que vous rencontrer lors du démarrage d'un projet. Nous vous encouragons à reporter tous les obstacles que vous avez eu comme une documentation manquantes, des indications éronnées ou similaires. Nous sommes des perfectionnistes, donc même une erreur typographique, dites le nous !

source: Reporting an Issue
fr: Reporter une erreur

source: If you found anything wrong, a crash, segfault, missing documentation, invalid spelling, weird example, please take 2 minutes to report the issue.
fr: Si vous avez une erreur, un crash, une erreur de segmentation, une documentation éronnée, une traduction incomplète, des exemples bizarres, prenez 2 minutes pour reporter l'erreur.

source: Move your logging level to debug by editing `<user_directory>/.kivy/config.ini`::
fr: Changer le niveau de log à debug en éditant le fichier `<user_directory>/.kivy/config.ini`::

source: Execute again your code, and copy/paste the complete output to http://paste.pocoo.org/, including the log from kivy and the python backtrace.
fr: Exécuter encore une fois votre code, et copier/coller l'intégralité de la sortie sur http://paste.pocoo.org, en incluant les logs de Kivy et la trace de Python

source: Open https://github.com/tito/kivy/issues/
fr: Ouvrez https://github.com/tito/kivy/issues/

source: Write a title of your issue
fr: Ecriver le titre de votre problème

source: Explain how we can do to reproduce the issue + paste the link of the output previously sent on pocoo
fr: Expliquez comment nous pouvons reproduire le problème + copier le lien de la sortie que vous avez précédemment envoyer sur pocoo

source: Validate the issue, you're done !
fr: Validez le rapport, et vous avez terminer !

source: If you feel good, you can also try to resolve the bug, and contribute by sending us the patch :) Read the next section about how to do it.
fr: Si vous vous sentez capable, vous pouvez aussi tenter de résoudre le bug, et contribuer en nous envoyant le patch ! Lisez la prochaine section pour savoir comment procéder.

source: Code Contributions
fr: Contributions de code

source: Code contributions (patches, new features) are the most obvious way to help with the project's development. Since this is so common we ask you to follow our workflow to most efficiently work with us. Adhering to our workflow ensures that your contribution won't be forgotten or lost. Also, your name will always be associated with the change you made, which basically means eternal fame in our code history (you can opt-out if you don't want that).
fr: Les contributions de code (patches, nouvelles fonctionnalitées) sont un moyen de contribuer efficacement au développement du projet. Pour ce faire, nous vous demandons de suivre une certaine démarche afin d'être le plus efficace possible. Adérer à notre démarche nous assure que votre contribution ne sera pas oubliée ou perdue. Aussi, votre nom sera toujours associés avec la contribution que vous ferez, ce qui basiquement veux dire que vous serez éternelement célèbre dans l'historique de note code (vous pouvez nous l'indiquez si vous ne voulez pas cela).

source: Git & GitHub
fr: Git et GitHub

source: We use git as our version control system for our code base. If you have never used git or a similar DVCS (or even any VCS) before, we strongly suggest you take a look at the great documentation that is available for git online. The `Git Community Book <http://book.git-scm.com/>`_ or the `Git Screencasts <http://gitcasts.com/>`_ are both great ways to learn git. Trust us when we say that git is a great tool. It may seem daunting at first, but after a while you'll (hopefully) love it as much as we do. Teaching you git, however, is well beyond the scope of this document.
fr: Nous utilisons git pour gérer le versionning de notre code source. Si vous n'avez jamais entendu parler de git ou d'un gestionnaire de code source similaire (DVCS ou VCS) avant, nous vous recommandons fortement de regarder en premier lieux l'excellent documentation qui est disponible en ligne pour git exclusivement. Le livre `Git Community Book <http://book.git-scm.com/>`_ ou `Git Screencasts <http://gitcasts.com/>_ sont tous les deux très bon pour apprendre git. Fait nous confiance quand nous vous disons que git est un outil excellent. Il peut être difficile à utiliser au premier abords, mais après quelques temps, vous l'aimerez autant que nous (espérons). Par contre, vous apprendre l'utilisation de git n'est pas abordée dans cette documentation.

source: Also, we use `GitHub <http://github.com>`_ to host our code. In the following we will assume that you have a (free) GitHub account. While this part is optional, it allows for a tight integration between your patches and our upstream code base. If you don't want to use GitHub, we assume you know what you do anyway.
fr: Aussi, nous utilisons `GitHub <http://github.com>`_ pour héberger notre code source. Pour la suite nous assumons que vous avez un compte GitHub (gratuit). Bien que cette partie est optionnelle, elle nous permet une intégration très simplifiée entre votre contribution et notre code de dévelopement. Si vous ne voulez pas utiliser GitHub, nous assumons que vous savez que ce vous faite.

source: Code Workflow
fr: Partager du code

source: So here is the initial setup to begin with our workflow (you only need to do this once to install Kivy). Basically you follow the installation instructions from :ref:`dev-install`, but you don't clone our repository, but the fork you create with the following steps:
fr: Voici les étapes initiales pour démarrer dans notre démarche (vous n'avez besoin de faire ceci qu'une seule fois pour installer Kivy). Basiquement vous suivez les instructions depuis :ref:`dev-install`, non pas pour cloner notre dépot, mais pour créer un force avec les étapes suivantes:

source: Log in to GitHub
fr: Identifiez vous sur GitHub

source: Create a fork of the `Kivy repository <https://github.com/tito/kivy>`_ by clicking the *fork* button.
fr: Créer un fork du `dépot Kivy <https://github.com/tito/kivy>`_ en cliquant sur le bouton *fork*.

source: Clone your fork of our repository to your computer. Your fork will have the git remote name 'origin' and you will be on branch 'master'.
fr: Clonez le fork sur votre ordinateur. Votre fork aura donc le nom distant 'origin' et vous serez sur la branch 'master'.

source: Compile and set up PYTHONPATH or install (see :ref:`dev-install`).
fr: Compilez et configurer la variable d'environement PYTHONPATH, ou installer (voir :ref:`dev-install`).

source: Install our pre-commit hook that ensures your code doesn't violate our styleguide by executing 'make hook' in your clone. This will run our styleguide check whenever you do a commit, and if there are violations in the parts that you changed, your commit will be aborted. Fix & retry.
fr: Installez notre hook de pre-commit qui assure que le code source ne violera pas notre style de code, en éxecutant 'make hook' dans votre clone. Ceci exécutera l'analyse de style chaque fois que vous ferez un commit, et si des violations sont détecter dans les changements, le commit sera annulé. Corrigez et recommencez.

source: Now, whenever you want to create a patch, you follow the following steps:
fr: Maintenant, dès que vous voulez créer un patch, suivez les étapes suivantes:

source: See if there is a ticket in our bug tracker for the fix or feature and announce that you'll be working on it if it doesn't yet have an assignee.
fr: Regardez s'il existe un ticket dans notre gestionnaire de bug pour cette erreur ou fonctionnalité, et annoncez que vous travaillez dessus si personne n'a été déjà assigné.

source: Create a new, appropriately named branch in your local repository for that specific feature or bugfix. (Keeping a new branch per feature makes sure we can easily pull in your changes without pulling any other stuff that is not supposed to be pulled.)
fr: Créer une nouvelle branche dans votre dépot local pour cette fonctionnalité spécifique ou ce bug. (Veuillez garder en mémoire que créer une nouvelle branche par fonctionnalités nous assure de pouvoir récupérer cette fonctionnalité uniquement, sans récupérer d'autres morceaux non désirés.)

source: Modify the code to do what you want (e.g., fix it).
fr: Modifiez le code pour ce que vous voulez faire (par exemple, corriger.)

source: Test the code. Try to do this even for small fixes. You never know whether you have introduced some weird bug without testing.
fr: Testez le code. Faite le aussi pour les petites corrections. On ne peut jamais savoir si le changement introduit ne va pas faire apparaître des comportements bizarres sans tester.

source: Do one or more minimal, atomic commits per fix or per feature. Minimal/Atomic means *keep the commit clean*. Don't commit other stuff that doesn't logically belong to this fix or feature. This is **not** about creating one commit per line changed. Use ``git add -p`` if necessary.
fr: Faite un ou des petits, atomique commits par corrections ou fonctionnalités. Atomique veut dire de *garder le commit propre*. Ne commitez pas des changements qui n'ont pas de rapports entre eux, ou d'où la logique ne correspond en rien au bug ou à la fonctionnalité introduite. Cela ne veux **pas** dire de créer un commit par ligne. Utilisez ``git add -p`` si nécessaire.

source: Give each commit an appropriate commit message, so that others who are not familiar with the matter get a good idea of what you changed.
fr: Donnez à chacun de vos commits un message approprié, pour que d'autres contributeurs qui ne sont pas dans le sujet ai une idée de ce que vous avez changé.

source: Once you are satisfied with your changes, merge with our upstream repository. We can pull your stuff, but since you know best what you changed, you should do the merge.
fr: Une fois que vous êtes satisfait de vos changements, combinez vos changements avec notre dépot de dévelopement. Vous pouvez récupérer (pull) notre travail, mais puisque vous êtes le mieux placé pour ce que vous avez fait, vous pouvez combiner.

source: Push to your remote repository on GitHub.
fr: Envoyez (push) les changements vers le dépot distant sur GitHub.
