Repository: NateWeiler/Resources
Catalog: Python/Kivy/kivy-translations/sources/*/index.po
Languages: fr

source: Welcome to Kivy
fr: Bienvenue sur Kivy

source: Welcome to Kivy's documentation. Kivy is an open source software library for rapid development of applications equipped with novel user interfaces, such as multi-touch apps.
fr: Bienvenue dans la documentaion de Kivy. Kivy est une librarie open-source pour le développement rapide d'applications utilisant des interfaces nouvelles, tel que les applications multitouches.

source: We recommend that you get started with :ref:`installation` and then head over to the :ref:`quickstart` document. Besides the quickstart, there is also a more detailed :ref:`architecture`.
fr: Nous vous recommandons de démarrer avec :ref:`installation` puis de continuer sur :ref:`quickstart`. Outre le quickstart, il ya également une description plus détaillée de l':ref:`architecture`.

source: If you want to contribute to Kivy, make sure to read :ref:`contributing`. If your concern isn't addressed in the documentation, feel free to :ref:`contact`.
fr: Si vous voulez contribuer à Kivy, assurez vous d'avoir lu le :ref:`contributing`. Si votre problème n'est pas abordé dans la documentation, n'hésitez pas à nous :ref:`contact`

source: User's Guide
fr: Guide Utilisateur

source: This part of the documentation explains the basic ideas behind Kivy's design and why you'd want to use it. It goes on with a discussion of the architecture and shows you how to create stunning applications in short time using the framework.
fr: Cette partie de la documentation explique les idées à l'origine du design de Kivy, et pourquoi vous voudriez l'utiliser. Une partie est consacré à l'architecture et montre comment créer des applications à couper le souffle en quelques minutes grâce à ce framework.

source: The API reference is a lexicographic list of all the different classes, methods and features that Kivy offers.
fr: La référence API est une liste lexicographique de l'ensemble des différentes classes, des méthodes et des fonctionnalités de Kivy.

source: Appendix
fr: Annexe

source: The appendix contains licensing information and an enumeration of all the different module, class, function and variable names available in Kivy.
fr: L'annexe contient des informations de licence et une énumération de tous les noms des modules, classes, fonctions et variables disponibles dans Kivy.

source: License
fr: Licence

source: Kivy is released under the terms of the GNU LGPL Version 3. You should have received a copy of the LGPL alongside your Kivy distribution. See the file COPYING in the Kivy root folder. An online version of the license can be found at http://www.gnu.org/licenses/lgpl-3.0.txt
fr: Kivy est disponible sous les termes de la licence GNU LGPL Version 3. Vous devriez avoir une copy de la LGPL avec la distribution de Kivy. Veuillez vous reporter au fichier COPYING dans le dossier racine de Kivy. Une version en ligne est disponible à http://www.gnu.org/licenses/lgpl-3.0.txt

source: In a nutshell the license allows you to use Kivy in your own projects, regardless if they are open source, closed source, commercial or free. The one thing the license does enforce is that if you make changes to the Kivy sourcecode **itself**, you have to share those changes with us. For a more thorough legal explanation of the terms and conditions, please refer to the documents listed above.
fr: Pour faire court la licence vous permet de créer vos propres projets en utilisant Kivy, qu'ils soient publique (open source), privé (closed source), commercial ou gratuit. Le seul point que la licence vous force à respecter est si vous avez fait des changements dans le **code source de Kivy**, vous devez partager ces changements avec nous. Pour une explication plus légale de ces termes, veuillez vous référer au document listé ci-dessus.

source: For a list of authors, please see the file AUTHORS that accompanies the Kivy source code distribution (next to COPYING).
fr: Pour une liste des auteurs, veuillez consulter le fichier AUTHORS qui accompagne le code source de Kivy (à coté de COPYING)

source: Kivy -- Copyright 2011, The Kivy Authors. All rights reserved.
fr: Kivy -- Copyright 2011, The Kivy Author. Tous droits réservés.
